Repository: sizzlelab/aaltoapps
Catalog: config/locales/gettext/*/aaltoapps.po
Languages: fi

source: or
fi: tai

source: &#8592; Previous
fi: &#8592; Edellinen

source: (User has not rated this app)
fi: (Käyttäjä ei ole arvostellut tätä sovellusta)

source: , or
fi: tai

source: Accept
fi: Hyväksy

source: Add Photo
fi: Lisää kuva

source: Add a new download:
fi: Lisää uusi tiedosto:

source: Add a product
fi: Lisää tuote

source: Add new download
fi: Lisää uusi tiedosto

source: Add new platform
fi: Lisää uusi alusta

source: Admin comments
fi: Ylläpitäjän kommentit

source: All
fi: Kaikki

source: Approve
fi: Hyväksy

source: Are you sure you want to approve this product?
fi: Oletko varma, että haluat hyväksyä tämän tuotteen?

source: Are you sure you want to block this product?
fi: Oletko varma että haluat muuttaa tämän tuotteen estetyksi?

source: Are you sure you want to revoke your own administrator role?
fi: Oletko varma että haluat poistaa itseltäsi admin-oikeudet?

source: Are you sure?
fi: Oletko varma?

source: Back
fi: Takaisin

source: Block
fi: Estä

source: Blocked products
fi: Estetyt sovellukset

source: Browse all applications
fi: Kaikki sovellukset

source: Cancel
fi: Peruuta

source: Cancel adding this download
fi: Peru tämän tiedoston lisääminen

source: Cannot delete platform that has products
fi: Alustaa, jolla on sovelluksia, ei voida poistaa

source: Category image url
fi: Kategorian kuvan url

source: Category was successfully created.
fi: Kategoria luotiin onnistuneesti.

source: Category was successfully updated.
fi: Kategoriaa päivitettiin onnistuneesti

source: Change Photo
fi: Vaihda kuva

source: Choose a platform
fi: Valitse alusta

source: Choose language:
fi: Valitse kieli:

source: Close
fi: Sulje

source: Comment deleted.
fi: Kommentti poistettu.

source: Comment was not created.
fi: Kommenttia ei luotu.

source: Create comment
fi: Luo kommentti

source: Current photo:
fi: Nykyinen kuva:

source: Decline
fi: Kieltäydy

source: Delete
fi: Poista

source: Delete file
fi: Poista tiedosto

source: Description
fi: Kuvaus

source: Destroy
fi: Tuhoa

source: Detailed view
fi: Yksityiskohdat

source: Downloads
fi: Ladattavat tiedostot

source: Edit
fi: Muokkaa

source: Editing platform
fi: Alustan muokkaus

source: Editing product
fi: Tuotteen muokkaus

source: Editing user
fi: Käyttäjän muokkaus

source: Email
fi: Sähköposti

source: Featured
fi: Suositeltu

source: Female
fi: Nainen

source: Fields marked with asterisk (*) are compulsory
fi: Kentät, jotka ovat merkitty (*) ovat pakollisia

source: File
fi: Tiedosto

source: File deleted.
fi: Tiedosto poistettu.

source: Firstname
fi: Etunimi

source: Grant administrator role
fi: Anna admin-oikeudet

source: I accept the OtaSizzle [[Publisher Terms and Conditions]]
fi: Hyväksyn OtaSizzlen [[julkaisijan käyttäjäehdot]]

source: I accept the OtaSizzle [[Terms and Conditions]]
fi: Hyväksyn OtaSizzlen [[käyttäjäehdot]]

source: Image URL
fi: Kuvan URL

source: Image url
fi: Kuvan url

source: In order to register, you must accept the OtaSizzle "Terms and Conditions".
fi: Rekisteröityäksesi, sinun täytyy hyväksyä OtaSizzlen "käyttäjäehdot".

source: Lastname
fi: Sukunimi

source: List platforms
fi: Alustat

source: Listing %{platform} applications
fi: %{platform} -sovellukset

source: Listing %{platform} applictions with the tag %{tags}
fi: %{platform} -sovellukset, joilla on tagi %{tags}

source: Listing all applications
fi: Kaikki sovellukset

source: Listing applications with status: %{status}
fi: Sovellukset tilassa: %{status}

source: Listing applictions with the tag %{tags}
fi: Sovellukset, joilla on tagi %{tags}

source: Listing categories
fi: Kategoriat

source: Listing featured %{platform} applications
fi: suositellut %{platform} -sovellukset

source: Listing featured applications
fi: Suositellut sovellukset

source: Listing my applications
fi: Omat sovellukseni

source: Listing platforms
fi: Alustat

source: Listing users
fi: Käyttäjät

source: Logged in
fi: Olet kirjautunut sisään.

source: Logged in as %{username}
fi: Kirjautuneena: %{username}

source: Login
fi: Kirjaudu sisään

source: Login failed
fi: Sisäänkirjautuminen epäonnistui

source: Login successful
fi: Olet kirjautunut sisään

source: Logout
fi: Kirjaudu ulos

source: Logout successful
fi: Olet kirjautunut ulos

source: Make featured
fi: Tee suositeltu

source: Male
fi: Mies

source: Move down
fi: Siirrä alapäin

source: Move up
fi: Siirrä ylöspäin

source: My Apps
fi: Omat sovellukseni

source: Name
fi: Nimi

source: Name of the product
fi: Tuotteen nimi

source: New App
fi: Uusi sovellus

source: New Category
fi: Uusi kategoria

source: New Platform
fi: Uusi alusta

source: New User
fi: Uusi käyttäjä

source: New comment created.
fi: Kommentti luotu.

source: Next &#8594;
fi: Seuraava &#8594;

source: No applications available.
fi: Ei sovelluksia.

source: Number of views
fi: Katselukerrat

source: Order
fi: Järjestysnumero

source: Password
fi: Salasana

source: Platform
fi: Alusta

source: Platform was successfully created
fi: Alusta luotiin onnistuneesti.

source: Platform was successfully updated.
fi: Alusta päivitetty onnistuneesti.

source: Platform was successufully deleted.
fi: Alusta poistettu.

source: Platforms
fi: Alustat

source: Please fill in the following form.
fi: Ole hyvä ja täytä alla oleva lomake.

source: Please login to add comments
fi: Voit kommentoida kun olet kirjautunut sisään

source: Popularity
fi: Katselukerrat

source: Popularity:
fi: Katselukerrat:

source: Product was successfully created.
fi: Sovellus luotiin onnistuneesti

source: Product was successfully updated.
fi: Sovellus päivitettiin onnistuneesti.

source: Products
fi: Sovellukset

source: Products pending approval
fi: Hyväksyntää odottavat tuotteet

source: Publication date
fi: Julkaisupäivä

source: Published
fi: Julkaistu

source: Published Products
fi: Julkaistut sovellukset

source: Publisher
fi: Julkaisija

source: Publisher:
fi: Julkaisija:

source: Rate
fi: Arvostele

source: Rating
fi: Arvio

source: Rating was not created/updated.
fi: Arviota ei luotu/päivitetty

source: Rating was successfully created/updated.
fi: Arvio luotiin/päivitettiin onnistuneesti.

source: Receive admin e-mail
fi: Vastaanota ylläpidon sähköpostia

source: Register
fi: Rekisteröidy

source: Register to aaltoapps
fi: Rekisteröidy AaltoAppsiin

source: Remove from featured
fi: Poista suositelluista

source: Replace with
fi: Korvaa tällä

source: Replace with:
fi: Korvaa tällä:

source: Report issue
fi: Ilmoita ongelmasta

source: Request approval
fi: Pyydä hyväksyntää

source: Revoke administrator role
fi: Poista admin-oikeudet

source: Save
fi: Tallenna

source: Save comment
fi: Tallenna kommentti

source: Search results
fi: Hakutulokset

source: Show
fi: Näytä

source: State:
fi: Tila:

source: Submit
fi: Hyväksy

source: Switch to mobile version
fi: Siirry mobiiliversioon

source: Switch to standard version
fi: Siirry tavalliseen versioon

source: Tags
fi: Tagit

source: Terms and conditions
fi: Käyttäjäehdot

source: These comments are only shown to administrators and %{comments_shown_for}.
fi: Nämä kommentit näkyvät vain ylläpitäjille ja %{comments_shown_for}.

source: This field supports Markdown formatting ([[more information]])
fi: Tämä kenttä tukee Markdown-muotoilua ([[lisätietoja]])

source: Title
fi: Otsikko

source: Type
fi: Tyyppi

source: Unspecified
fi: Määrittelemätön

source: User rating
fi: Käyttäjän arvio

source: User was successfully updated.
fi: Käyttäjä päivitettiin onnistuneesti.

source: Username
fi: Käyttäjätunnus

source: Users
fi: Käyttäjät

source: Validation errors prohibited this platform from being saved
fi: Virheet, jotka estävät alustan tallentamisen

source: Validation errors prohibited this product from being saved
fi: Virheet, jotka estävät sovelluksen tallentamisen

source: Validation errors prohibited this rating from being saved
fi: Virheet, jotka estävät arvion tallentamisen

source: Validation errors prohibited this user from being saved
fi: Virheet, jotka estävät tuotteen tallentamisen

source: Validation errors prohibited user information from being saved
fi: Virheet, jotka estävät käyttäjätietojen tallentamisen

source: Your comment was not updated.
fi: Kommenttiasi ei päivitetty.

source: Your comment was successfully updated.
fi: Kommenttisi päivitettiin onnistuneesti.

source: Your rating:
fi: Sinun arviosi:

source: administrator
fi: adminstrator

source: approval_status|Status
fi: Tila

source: blocked
fi: estetty

source: browse
fi: selaa

source: can not be given by the publisher of the product
fi: sovelluksen julkaisija ei voi antaa

source: can not be given for nonexistent product
fi: ei voida antaa olemattomalle sovellukselle

source: can not be given when not logged in
fi: ei voida antaa kun ei ole sisäänkirjautunut

source: comments_shown_for|the publisher of the product
fi: sovelluksen julkaisijalle

source: comments_shown_for|you
fi: sinulle

source: file
fi: tiedosto

source: home
fi: etusivu

source: is_featured|yes
fi: kyllä

source: loading...
fi: ladataan...

source: login
fi: kirjaudu sisään

source: logout
fi: kirjaudu ulos

source: main menu
fi: päävalikko

source: markdown_help|(line indented with 4 or more spaces)
fi: (rivi sisennetty 4:llä tai useammalla välilyönnillä)

source: markdown_help|6th level header
fi: 6:nnen tason otsikko

source: markdown_help|<, >, & and " need to be escaped (%s, %s, %s, %s).
fi: <, >, & ja " -merkkien eteen täytyy laittaa \-merkki (%s, %s, %s, %s)

source: markdown_help|An empty line starts a new paragraph.
fi: Tyhjä rivi aloittaa uuden kappaleen.

source: markdown_help|Code
fi: Ohjelmakoodi

source: markdown_help|HTML tags are not allowed.
fi: HTML-tagit eivät ole sallittuja.

source: markdown_help|Headers
fi: Otsikot

source: markdown_help|Item %s
fi: Kohta %s

source: markdown_help|Links
fi: Linkit

source: markdown_help|Newlines are preserved.
fi: Rivinvaihdot säilytetään.

source: markdown_help|Ordered lists
fi: Numeroidut listat

source: markdown_help|Subitem %s
fi: Alikohta %s

source: markdown_help|Text style
fi: Tekstin tyyli

source: markdown_help|The numbers don't need to be in order. The list will be automatically renumbered.
fi: Numeroiden ei tarvitse olla järjestyksessä. Lista numeroidaan automaattisesti uudelleen.

source: markdown_help|There's no need to escape special characters in the code.
fi: Erikoismerkit voidaan kirjoittaa ohjelmakooditekstin sekaan sellaisenaan

source: markdown_help|This site uses a variant of [[Markdown]].
fi: Sivusto käyttää muunneltua [[Markdown]]-kieltä

source: markdown_help|Unordered lists
fi: Numeroimattomat listat

source: markdown_help|an example link
fi: esimerkkilinkki

source: markdown_help|bold
fi: lihavoitu

source: markdown_help|code block
fi: monirivinen koodilohko

source: markdown_help|header
fi: otsikko

source: markdown_help|inline code
fi: koodi tekstin seassa

source: markdown_help|italic
fi: kursiivi

source: markdown_help|subheader
fi: alaotsikko

source: no rating
fi: ei arviota

source: non-local user
fi: ei-paikallinen käyttäjä

source: normal user
fi: normaali käyttäjä

source: not yet rated
fi: ei vielä arvioitu

source: publish
fi: julkaise

source: published
fi: julkaistu

source: receives admin email
fi: vastaanottaa ylläpidon sähköpostia

source: register
fi: rekisteröidy

source: search
fi: etsi

source: user_link|error!
fi: virhe!

source: user_link|unknown
fi: tuntematon

source: waiting for approval
fi: odottaa hyväksymistä
